miniwinwm/miniwinwm/Renesas/RX65N/MiniWinFile/src/smc_gen/r_usb_basic/src/hw/r_usb_creg_access.c
#else   /* USB_CFG_USE_USBIP == USB_CFG_IP1 */
            p_reg = (void *)&(USB_M0.CFIFOCTR);

#endif  /* USB_CFG_USE_USBIP == USB_CFG_IP1 */
            break;

            case    USB_D0USE:
            case    USB_D0DMA:
#if USB_CFG_USE_USBIP == USB_CFG_IP1
                p_reg = (void *)&(USB_M1.D0FIFOCTR);

#else   /* USB_CFG_USE_USBIP == USB_CFG_IP1 */
                p_reg = (void *)&(USB_M0.D0FIFOCTR);

#endif  /* USB_CFG_USE_USBIP == USB_CFG_IP1 */
                break;
            case    USB_D1USE:
            case    USB_D1DMA:
#if USB_CFG_USE_USBIP == USB_CFG_IP1
                p_reg = (void *)&(USB_M1.D1FIFOCTR);

#else   /* USB_CFG_USE_USBIP == USB_CFG_IP1 */
                p_reg = (void *)&(USB_M0.D1FIFOCTR);

#endif  /* USB_CFG_USE_USBIP == USB_CFG_IP1 */
            break;
            default:
            USB_DEBUG_HOOK(USB_DEBUG_HOOK_STD | USB_DEBUG_HOOK_CODE13);
            break;
        }

#endif  /* (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_REPI */
    }
    else
    {
#if ( (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST )
        switch (pipemode)
        {
            case USB_CUSE :
                p_reg = (void *) &(ptr->ipp->CFIFOCTR);
            break;
            case USB_D0USE :
            case USB_D0DMA:
                p_reg = (void *) &(ptr->ipp->D0FIFOCTR);
            break;
            case USB_D1USE :
            case USB_D1DMA:
                p_reg = (void *) &(ptr->ipp->D1FIFOCTR);
            break;
            default :
                USB_DEBUG_HOOK(USB_DEBUG_HOOK_STD | USB_DEBUG_HOOK_CODE13);
            break;
        }

#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */
    }
    return p_reg;
}
/******************************************************************************
 End of function hw_usb_get_fifoctr_adr
 ******************************************************************************/

/******************************************************************************
 Function Name   : hw_usb_read_fifoctr
 Description     : Returns the value of the FIFOCTR register corresponding to 
                 : specified PIPEMODE.
 Arguments       : usb_utr_t *ptr       : Pointer to usb_utr_t structure.
                 : uint16_t  pipemode   : CUSE/D0DMA/D1DMA
 Return value    : FIFOCTR content
 ******************************************************************************/
uint16_t hw_usb_read_fifoctr (usb_utr_t *ptr, uint16_t pipemode)
{
    volatile __evenaccess uint16_t *p_reg;

    p_reg = (uint16_t *) hw_usb_get_fifoctr_adr(ptr, pipemode);

    return *p_reg;
}
/******************************************************************************
 End of function hw_usb_read_fifoctr
 ******************************************************************************/

/******************************************************************************
 Function Name   : hw_usb_set_bval
 Description     : Set BVAL (Buffer Memory Valid Flag) to the number given; in 
                 : the FIFOCTR corresponding to the specified PIPEMODE.
 Arguments       : usb_utr_t *ptr       : Pointer to usb_utr_t structure.
                 : uint16_t  pipemode   : CUSE/D0DMA/D1DMA
 Return value    : none
 ******************************************************************************/
void hw_usb_set_bval (usb_utr_t *ptr, uint16_t pipemode)
{
    volatile __evenaccess uint16_t *p_reg;

    p_reg = (uint16_t *) hw_usb_get_fifoctr_adr(ptr, pipemode);

    (*p_reg) |= USB_BVAL;
}
/******************************************************************************
 End of function hw_usb_set_bval
 ******************************************************************************/

/******************************************************************************
 Function Name   : hw_usb_set_bclr
 Description     : Set BCLR (CPU Buffer Clear) to the number given; in the 
                 : FIFOCTR corresponding to the specified PIPEMODE.
 Arguments       : usb_utr_t *ptr       : Pointer to usb_utr_t structure.
                 : uint16_t  pipemode   : CUSE/D0DMA/D1DMA
 Return value    : none
 ******************************************************************************/
void hw_usb_set_bclr (usb_utr_t *ptr, uint16_t pipemode)
{
    volatile __evenaccess uint16_t *p_reg;

    p_reg = (uint16_t *) hw_usb_get_fifoctr_adr(ptr, pipemode);

    *p_reg = USB_BCLR;
}
/******************************************************************************
 End of function hw_usb_set_bclr
 ******************************************************************************/

/******************************************************************************
 Function Name   : hw_usb_write_intenb
 Description     : Data is written to INTENB register, 
                 : enabling/disabling the various USB interrupts.
 Arguments       : usb_utr_t *ptr  : Pointer to usb_utr_t structure.
                 : uint16_t  data  : The value to write.
 Return value    : none
 ******************************************************************************/
void hw_usb_write_intenb (usb_utr_t *ptr, uint16_t data)
{
    if (USB_NULL == ptr)
    {
#if ( (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI )
#if USB_CFG_USE_USBIP == USB_CFG_IP0
        USB_M0.INTENB0.WORD = data;
#else
        USB_M1.INTENB0.WORD = data;
#endif
#endif  /* (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_REPI */
    }
    else
    {
#if ( (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST )
        ptr->ipp->INTENB0.WORD = data;

#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */
    }
}
/******************************************************************************
 End of function hw_usb_write_intenb
 ******************************************************************************/

/******************************************************************************
 Function Name   : hw_usb_set_intenb
 Description     : Bit(s) to be set in INTENB register, 
                 : enabling the respective USB interrupt(s).
 Arguments       : usb_utr_t *ptr  : Pointer to usb_utr_t structure.
                 : uint16_t  data  : Bit pattern: Respective interrupts with '1' 
                 :                   will be enabled.
 Return value    : none
 ******************************************************************************/
void hw_usb_set_intenb (usb_utr_t *ptr, uint16_t data)
{
    if (USB_NULL == ptr)
    {
#if ( (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI )
#if USB_CFG_USE_USBIP == USB_CFG_IP0
        USB_M0.INTENB0.WORD |= data;
#else
        USB_M1.INTENB0.WORD |= data;
#endif
#endif  /* (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_REPI */
    }
    else
    {
#if ( (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST )
        ptr->ipp->INTENB0.WORD |= data;

#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */
    }
}
/******************************************************************************
 End of function hw_usb_set_intenb
 ******************************************************************************/

#if ( (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST )
/******************************************************************************
 Function Name   : hw_usb_clear_enb_vbse
 Description     : Clear the VBE-bit of INTENB register,
                 : to prohibit VBUS interrupts.
 Arguments       : usb_utr_t *ptr  : Pointer to usb_utr_t structure.
 Return value    : none
 ******************************************************************************/
void hw_usb_clear_enb_vbse (usb_utr_t *ptr)
{
    ptr->ipp->INTENB0.WORD &= (~USB_VBSE);

